[
  {
    "ID": "c9699cfd-b0bc-4928-8705-51fcd43867b9",
    "title": "Agile",
    "slug": "agile",
    "content": "Agile is a software development methodology that focuses on communication and feedback throughout the development process. It also emphasizes working software over comprehensive documentation, and each iteration that a team makes to its product is seen as an opportunity to perfect it. Agile continues to grow in popularity, and its focus on communication with users directly benefits digital products. \n\n![agile](https://lh5.googleusercontent.com/_Moq-tXjHJSAYdjrBGGFIdx6gfLr4wImblU5Gpk5YEEWc8W3-eovtD_t9s_UOhqIZToX6bMvqOI8lo7FS_1l=w1294-h668)",
    "description": "Agile is a software development methodology that focuses on communication and feedback throughout the development process. It also emphasizes working software over comprehensive documentation, and each iteration that a team makes to its product is seen as an opportunity to perfect it. Agile continues to grow in popularity, and its focus on communication with users directly benefits digital products. ",
    "tag": "A",
    "createdAt": 1655741917276,
    "updatedAt": 1655816482901
  },
  {
    "ID": "e3b1370a-bfd0-4654-a3dc-7574310817a3",
    "title": "Behavioral Product Management",
    "slug": "behavioral-product-management",
    "content": "The use of behavioral science and human psychology in product design is referred to as behavioral product management. It is presumptively assumed that humans are illogical, and that there are certain behavioral patterns that can aid in increasing both user experience and conversion rates.\n\n![Behavioral Product Management](https://lh4.googleusercontent.com/HZo3J2ABGPMIEuG0GOAw6r1zMRXFPQumcI0E5NRDHcAFCxu3uLq3M3bZKNU2bBYOTxx7eCcqYGL-CEhOqZIu=w1294-h668)",
    "description": "The use of behavioral science and human psychology in product design is referred to as behavioral product management. It is presumptively assumed that humans are illogical, and that there are certain behavioral patterns that can aid in increasing both user experience and conversion rates.",
    "tag": "B",
    "createdAt": 1655741944160,
    "updatedAt": 1655816654789
  },
  {
    "description": "API means application programming interface, which makes different technologies communicate. ",
    "slug": "api",
    "title": "API",
    "tag": "A",
    "ID": "aff7d524-118c-49c8-afe3-289eaf4f1dc9",
    "content": "API stands for an application programming interface. They make it possible to talk about different technologies to each other. An API allows the sharing of data or functions of a digital product with another digital product. They provide a clearly defined interface to enable various components of larger applications to work together, and they can reduce the amount of code that is required. In other words, they serve as bridges between your components, even if they were developed by different companies.\n\n![Api](https://lh4.googleusercontent.com/9dVlBr5ZmLjUmGjRZPv1kOTzMl1W9HkYl-e6_ZrHc9CMW4eko8039y3Vn1Me7mu4uefIJc8c6ATVCExOyJx7=w1294-h668)",
    "createdAt": 1655816348621,
    "updatedAt": 1655816690980
  },
  {
    "description": "A/B test is a testing method used by splitting hypotheses into 2 and observing which ones perform better.",
    "slug": "ab-test",
    "title": "AB Test",
    "tag": "A",
    "ID": "ad27e4d5-0138-41b7-a9ce-b9ff4c5a5cbf",
    "content": "A/B tests are basically split tests with a control element and its variation. Almost everything measurable can be tested in a digital product, UI elements to call to action. It depends on the idea of measuring the performances of 2 variations to decide which one is better.\n\n![AB Test](https://lh3.googleusercontent.com/YRtB1g1VzW2UJx7ZJJ4naPG_aIsWNXiH2WZoLtMJRBjyqvojLmM6ZTg9pqQlrAeicphSRZzM089eu95FfvOV=w1294-h668)\n",
    "createdAt": 1655816990875
  },
  {
    "description": "Conversion is a phrase used in digital products to describe the specific actions that users took.",
    "slug": "conversion-rate",
    "title": "Conversion Rate",
    "tag": "C",
    "ID": "f017c9f9-73e7-4ba2-9ce6-b4667624de43",
    "content": "Conversion is a digital product term that refers to desired actions users took. Conversion rate, on the other hand, is a metric to measure conversions. It is calculated by simply splitting the number of all traffic into a number of the desired action. \n\n![Conversion Rate](https://lh3.googleusercontent.com/DVenpBithYyy6MDJdp7vqDtD7QiIlXHT2ILi5IVQ86GQ6Sw-Mj85-afjwZHCPTYo_OvWro2nVklJk2BRT3Pq=w1294-h668)",
    "createdAt": 1655819595990
  },
  {
    "description": "CRO is an expression for conversion rate optimization.",
    "slug": "cro",
    "title": "CRO",
    "tag": "C",
    "ID": "d52b9fe2-8556-4cac-8847-c3d0c0f95912",
    "content": "CRO stands for conversion rate optimization. It includes all efforts aimed to increase the conversion rate of a product, ad, creative, website, online shop, mobile app, etc. \n\n",
    "createdAt": 1655819746147
  },
  {
    "description": "Design thinking provides a framework for solving user problems.",
    "slug": "design-thinking",
    "title": "Design Thinking",
    "tag": "D",
    "ID": "2610f288-c4d5-4590-a5c6-ae6ee00fc2c2",
    "content": "Design thinking is a relatively old methodology for designing. Design thinking gives a framework to solve the problems of users. In design thinking, there are steps to follow: empathize, define, ideate, prototype, and test.\n",
    "createdAt": 1655819993576
  },
  {
    "description": "Empathy mapping is a framework for reaching a better understanding of users. ",
    "slug": "empathy-mapping",
    "title": "Empathy Mapping",
    "tag": "E",
    "ID": "ca902d45-2be6-493b-b991-26b1448337e5",
    "content": "Empathy mapping is a strategy for increasing user experience by understand them. There are numerous empathy mapping approaches, but some general characteristics include asking the user what they are doing, seeing, hearing, thinking, and feeling.",
    "createdAt": 1655820117327
  },
  {
    "description": "The five-second test is a method can be conducted for discovering first impressions.",
    "slug": "five-second-test",
    "title": "Five Second Test",
    "tag": "F",
    "ID": "e0d76559-8f12-42f2-9f25-24ede112e052",
    "content": "The Five-second test is a user research method. It is a simple test aimed to get new insights into a product’s usability. After participants took a look at the product for 5 seconds, they asked simple questions. It’s good for understanding the first impression of the design.\n\n![Five Second Test](https://lh4.googleusercontent.com/pSM9OnhClhDScrajtJ_Y8cNpRoEfIlEmOnLX6DzCu5hRnn_57hxu1NrYuCnCGvLtqwpytOeSPluFH3ZtQ86x=w1294-h668)",
    "createdAt": 1655820242170
  },
  {
    "slug": "flow-charts",
    "description": "A flow chart is a straightforward visual representation of a complex process.",
    "title": "Flow Charts",
    "ID": "72659c16-e60d-494f-9b4f-a9b39c19da67",
    "content": "A flowchart is an easy-to-understand, visually presented diagram depicting the overall process. You will find that a flowchart is often used in business, science, and information technology-related activities, but they are equally useful for administrative processes. A flowchart will be of great use to you if you are the kind of person who likes visual solutions to problems.",
    "tag": "F",
    "createdAt": 1655820552737
  },
  {
    "title": "Growth Hacking",
    "ID": "1ab34652-639e-429a-89d2-aa2cf7e2534c",
    "slug": "growth-hacking",
    "tag": "G",
    "description": "Growth hacking is a set of strategies for tech-driven businesses.",
    "content": "Growth hacking is a relatively new marketing subfield generally used by tech-driven companies. Growth hacking focuses on ways to grow as a whole instead of just leads and acquisitions. Growth hackers use pirate funnels which occur through steps of awareness, acquisition, activation, retention, revenue, and referral.",
    "createdAt": 1655820635751
  },
  {
    "title": "GIF",
    "ID": "371749ea-d6ab-441a-a1c0-ad11f2638bb2",
    "slug": "gif",
    "tag": "G",
    "description": "GIF stands for graphics interchange format.",
    "content": "The graphics interchange format (GIF) is a sort of bitmap picture format established by CompuServe in 1987. The format allows up to 8 bits per pixel, giving a picture access to a 255-color palette. The greatest distinguishing feature of GIF is its support for animation, with each frame allowing for the usage of a new palette.",
    "createdAt": 1655820754214
  },
  {
    "title": "Hardware",
    "ID": "99c0cc0f-d6c2-4c1d-8c9b-7bc38b044039",
    "slug": "hardware",
    "tag": "H",
    "description": "Hardware is physical tools used in product development.",
    "content": "Hardware refers to the physical tools and mechanical equipment used in the development and use of your product. This could comprise the physical components of a computer as well as the tools required to use it, such as a keyboard, monitor, and mouse.",
    "createdAt": 1655820820011
  },
  {
    "title": "Integration",
    "ID": "637f5bf7-b1fd-4491-b472-d6e4c3df46c9",
    "slug": "integration",
    "tag": "I",
    "description": "Integration stands for merging different applications, elements or systems into one.",
    "content": "Software integration is the process of combining diverse software programs or pieces into a single system. The degree of integration can range from merging very small components to larger, more complicated systems. ",
    "createdAt": 1655820945690
  },
  {
    "title": "Jamstack",
    "ID": "cb59047b-5c16-4de9-a273-27b2c6f77353",
    "slug": "jamstack",
    "tag": "J",
    "description": "Jamstack is a framework for building static websites dynamicly.",
    "content": "Jamstack is an acronym that stands for JavaScript, API, and Markup. Web apps employ the programming language JavaScript. An API is a method of requesting data from another computer or application. Markup is code that gives browsers formatting instructions.",
    "createdAt": 1655821008234
  },
  {
    "title": "Javascript",
    "ID": "de536d1e-2980-49f1-b89e-20d465ca53ab",
    "slug": "javascript",
    "tag": "J",
    "description": "Javascript is a programming language. ",
    "content": "JavaScript is a scripting language that allows you to generate dynamically updating information, manipulate multimedia, animate graphics, and do a lot more.",
    "createdAt": 1655821104942
  },
  {
    "title": "Job Title",
    "ID": "695ee4f1-ab7b-4a30-9bb3-e438b23b5ebe",
    "slug": "job-title",
    "tag": "J",
    "description": "Job title is the formal name of  a position.",
    "content": "A job title is a precise identification of a position within an organization, which is usually accompanied with a job description that outlines the activities and responsibilities connected with it.",
    "createdAt": 1655821190210
  },
  {
    "title": "Kanban",
    "ID": "7504bb04-ebdf-4d4c-80f5-a415c4285fc5",
    "slug": "kanban",
    "tag": "K",
    "description": "Kanban is a lean product development approach that used for following work load. ",
    "content": "Kanban is an organizing method that generally divides workload into columns as to do, doing, done. It is a dynamic method invented to help teams more efficiently complete their work. Rather than only doing a bit of work at a time, every column gives the team an idea of how much work is being accomplished at any given moment. This is best practice because it creates an awareness of how much work is being completed. ",
    "createdAt": 1655821271488
  },
  {
    "title": "Lean",
    "ID": "67bd7fc1-b118-4617-98a3-0ee282cbae3a",
    "slug": "lean",
    "tag": "L",
    "description": "Lean is an approach for minimizing risk in development processes. ",
    "content": "Lean is a methodology for product development. It aims to maximize efficiency by eliminating waste of all kinds. With the inspiration of Toyota’s production framework; developers and entrepreneurs built different approaches to different systems. They all basically stand on the idea of developing the best possible product with given sources.",
    "createdAt": 1655821364286
  },
  {
    "title": "Landing Page",
    "ID": "648e1df4-dc8f-4b30-b0f2-e2cf4f8649c0",
    "slug": "landing-page",
    "tag": "L",
    "description": "Landing page is the page when users open a digital product. ",
    "content": "A landing page is the page users see first after clicking a link. Landing pages can be used for an ad that aims to increase conversions, as well as to measure a product idea.",
    "createdAt": 1655821430412
  },
  {
    "title": "MVP",
    "ID": "aa2b0b0b-7579-4b1a-b400-b779c67ec644",
    "slug": "mvp",
    "tag": "M",
    "description": "MVP is minimum viable product which used for testing the idea or start generating leads. ",
    "content": "MVP stands for a minimum viable product. It is basically a small version of a bigger idea. With an MVP, it’s possible to see if the idea is profitable or not, start generating leads, build a community, learn about the processes, and more. ",
    "createdAt": 1655821542965
  },
  {
    "title": "Microservice",
    "ID": "aeb53179-d495-4d54-a9ce-7493160e314d",
    "slug": "microservice",
    "tag": "M",
    "description": "Microservices are small apps that perform specific functions within a larger system.",
    "content": "Microservices express an architectural style. Generally, a  microservice functions as a part of a bigger application. Microservices make it easy to build scalable applications that not only have fewer bugs but are also easier to maintain. Using microservice architecture manages collaborations and divides complex projects. It’s a pattern that has been used in some form since the mid-90s. ",
    "createdAt": 1655821606403
  },
  {
    "title": "Navigation Map",
    "ID": "2a142ad0-acc2-41f9-98ed-fac1f986d2d9",
    "slug": "navigation-map",
    "tag": "N",
    "description": "Navigation is the process that allows users to reach their goals in the shortest amount of time possible.",
    "content": "The term navigation map can be used to describe certain attributes of a route instruction. A navigation map can also be described as a diagram that depicts the structure and organization of interconnected documents.",
    "createdAt": 1655821689338
  },
  {
    "title": "Onboarding",
    "ID": "812098dc-64ab-49cd-9a7c-75ce54b446ab",
    "slug": "onboarding",
    "tag": "O",
    "description": "Onboarding is the process of introducing a digital product to its users.",
    "content": "Introducing a product or service to users or customers is known as product onboarding. Onboarding is an essential part of the product adoption process. It enables people to become familiar with a product's features, as well as how to use it. \n\n![Onboarding](https://lh3.googleusercontent.com/-Y_PGhRSrt7ozr2sJtbNpi5xqJ7EYccKAZkhuzD3AOPOUbwyF2JA11Couox9yxmkIInJw49sUCaHQi_QDtR1=w1294-h668)",
    "createdAt": 1655821823973,
    "updatedAt": 1655821877919
  },
  {
    "title": "Prototype",
    "ID": "08b64bc2-6f69-4c51-a962-180b33cd6f4a",
    "slug": "prototype",
    "tag": "P",
    "description": "Prototypes are early versions of a product.",
    "content": "Prototypes are early examples of what you’re designing or building. They are created for getting feedback from the customer to ensure you two are on the same page about the product.",
    "createdAt": 1655821947345
  }
]